#1
grade<-sample(1:6,1)
if(grade>=3)
  cat(grade," 학년은 저학년입니다.")else
  cat(grade," 학년은 고학년입니다.")

#2
choice<-sample(1:5,1)
a<-switch(EXPR=choice,300+50,300-50,300*50,300/50,300%%50)
cat("결과값 : ",a)

#3
count<-sample(3:10,1)
deco<-sample(1:3,1)
switch(EXPR=deco,rep("*",count),rep("$",count),rep("#",count))

#4
score<-sample(0:100,1)
level<-switch(EXPR=-(score-101),
          "A 등급","A 등급","A 등급","A 등급","A 등급","A 등급","A 등급","A 등급","A 등급","A 등급",
          "B 등급","B 등급","B 등급","B 등급","B 등급","B 등급","B 등급","B 등급","B 등급","B 등급",
          "C 등급","C 등급","C 등급","C 등급","C 등급","C 등급","C 등급","C 등급","C 등급","C 등급",
          "D 등급","D 등급","D 등급","D 등급","D 등급","D 등급","D 등급","D 등급","D 등급","D 등급",
          "F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급",
          "F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급",
          "F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급",
          "F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급",
          "F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급",
          "F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급","F 등급"
          )
cat(score," 점은 ",level)
#5
paste(LETTERS,letters, sep="")
